knieriem/tinygo-stm32-svd/svd/stm32mp153.svd
        <register>
          <name>DRAMTMG1</name>
          <displayName>DRAMTMG1</displayName>
          <description>DDRCTRL SDRAM timing register 1</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00080414</resetValue>
          <fields>
            <field>
              <name>T_RC</name>
              <description>T_RC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>RD2PRE</name>
              <description>RD2PRE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>T_XP</name>
              <description>T_XP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG2</name>
          <displayName>DRAMTMG2</displayName>
          <description>DDRCTRL SDRAM timing register 2</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0305060D</resetValue>
          <fields>
            <field>
              <name>WR2RD</name>
              <description>WR2RD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>RD2WR</name>
              <description>RD2WR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>READ_LATENCY</name>
              <description>READ_LATENCY</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>WRITE_LATENCY</name>
              <description>WRITE_LATENCY</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG3</name>
          <displayName>DRAMTMG3</displayName>
          <description>DDRCTRL SDRAM timing register 3</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0050400C</resetValue>
          <fields>
            <field>
              <name>T_MOD</name>
              <description>T_MOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>T_MRD</name>
              <description>T_MRD</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>T_MRW</name>
              <description>T_MRW</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG4</name>
          <displayName>DRAMTMG4</displayName>
          <description>DDRCTRL SDRAM timing register 4</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x05040405</resetValue>
          <fields>
            <field>
              <name>T_RP</name>
              <description>T_RP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>T_RRD</name>
              <description>T_RRD</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>T_CCD</name>
              <description>T_CCD</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>T_RCD</name>
              <description>T_RCD</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG5</name>
          <displayName>DRAMTMG5</displayName>
          <description>DDRCTRL SDRAM timing register 5</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x05050403</resetValue>
          <fields>
            <field>
              <name>T_CKE</name>
              <description>T_CKE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>T_CKESR</name>
              <description>T_CKESR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>T_CKSRE</name>
              <description>T_CKSRE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>T_CKSRX</name>
              <description>T_CKSRX</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG6</name>
          <displayName>DRAMTMG6</displayName>
          <description>DDRCTRL SDRAM timing register 6</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02020005</resetValue>
          <fields>
            <field>
              <name>T_CKCSX</name>
              <description>T_CKCSX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>T_CKDPDX</name>
              <description>T_CKDPDX</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>T_CKDPDE</name>
              <description>T_CKDPDE</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG7</name>
          <displayName>DRAMTMG7</displayName>
          <description>DDRCTRL SDRAM timing register 7</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000202</resetValue>
          <fields>
            <field>
              <name>T_CKPDX</name>
              <description>T_CKPDX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>T_CKPDE</name>
              <description>T_CKPDE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG8</name>
          <displayName>DRAMTMG8</displayName>
          <description>DDRCTRL SDRAM timing register 8</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00004405</resetValue>
          <fields>
            <field>
              <name>T_XS_X32</name>
              <description>T_XS_X32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>T_XS_DLL_X32</name>
              <description>T_XS_DLL_X32</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG14</name>
          <displayName>DRAMTMG14</displayName>
          <description>DDRCTRL SDRAM timing register 14</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000000A0</resetValue>
          <fields>
            <field>
              <name>T_XSR</name>
              <description>T_XSR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG15</name>
          <displayName>DRAMTMG15</displayName>
          <description>DDRCTRL SDRAM timing register 15</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>T_STAB_X32</name>
              <description>T_STAB_X32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>EN_DFI_LP_T_STAB</name>
              <description>EN_DFI_LP_T_STAB</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ZQCTL0</name>
          <displayName>ZQCTL0</displayName>
          <description>DDRCTRL ZQ control register 0</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02000040</resetValue>
          <fields>
            <field>
              <name>T_ZQ_SHORT_NOP</name>
              <description>T_ZQ_SHORT_NOP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>T_ZQ_LONG_NOP</name>
              <description>T_ZQ_LONG_NOP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>ZQ_RESISTOR_SHARED</name>
              <description>ZQ_RESISTOR_SHARED</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIS_SRX_ZQCL</name>
              <description>DIS_SRX_ZQCL</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIS_AUTO_ZQ</name>
              <description>DIS_AUTO_ZQ</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ZQCTL1</name>
          <displayName>ZQCTL1</displayName>
          <description>DDRCTRL ZQ control register 1</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02000100</resetValue>
          <fields>
            <field>
              <name>T_ZQ_SHORT_INTERVAL_X1024</name>
              <description>T_ZQ_SHORT_INTERVAL_X1024</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
            <field>
              <name>T_ZQ_RESET_NOP</name>
              <description>T_ZQ_RESET_NOP</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ZQCTL2</name>
          <displayName>ZQCTL2</displayName>
          <description>DDRCTRL ZQ control register 2</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ZQ_RESET</name>
              <description>ZQ_RESET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ZQSTAT</name>
          <displayName>ZQSTAT</displayName>
          <description>DDRCTRL ZQ status register</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ZQ_RESET_BUSY</name>
              <description>ZQ_RESET_BUSY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFITMG0</name>
          <displayName>DFITMG0</displayName>
          <description>DDRCTRL DFI timing register 0</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x07020002</resetValue>
          <fields>
            <field>
              <name>DFI_TPHY_WRLAT</name>
              <description>DFI_TPHY_WRLAT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DFI_TPHY_WRDATA</name>
              <description>DFI_TPHY_WRDATA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DFI_T_RDDATA_EN</name>
              <description>DFI_T_RDDATA_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>DFI_T_CTRL_DELAY</name>
              <description>DFI_T_CTRL_DELAY</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFITMG1</name>
          <displayName>DFITMG1</displayName>
          <description>DDRCTRL DFI timing register 1</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000404</resetValue>
          <fields>
            <field>
              <name>DFI_T_DRAM_CLK_ENABLE</name>
              <description>DFI_T_DRAM_CLK_ENABLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DFI_T_DRAM_CLK_DISABLE</name>
              <description>DFI_T_DRAM_CLK_DISABLE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DFI_T_WRDATA_DELAY</name>
              <description>DFI_T_WRDATA_DELAY</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFILPCFG0</name>
          <displayName>DFILPCFG0</displayName>
          <description>DDRCTRL low power configuration register 0</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x07000000</resetValue>
          <fields>
            <field>
              <name>DFI_LP_EN_PD</name>
              <description>DFI_LP_EN_PD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFI_LP_WAKEUP_PD</name>
              <description>DFI_LP_WAKEUP_PD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DFI_LP_EN_SR</name>
              <description>DFI_LP_EN_SR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFI_LP_WAKEUP_SR</name>
              <description>DFI_LP_WAKEUP_SR</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DFI_LP_EN_DPD</name>
              <description>DFI_LP_EN_DPD</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFI_LP_WAKEUP_DPD</name>
              <description>DFI_LP_WAKEUP_DPD</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DFI_TLP_RESP</name>
              <description>DFI_TLP_RESP</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIUPD0</name>
          <displayName>DFIUPD0</displayName>
          <description>DDRCTRL DFI update register 0</description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00400003</resetValue>
          <fields>
            <field>
              <name>DFI_T_CTRLUP_MIN</name>
              <description>DFI_T_CTRLUP_MIN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>DFI_T_CTRLUP_MAX</name>
              <description>DFI_T_CTRLUP_MAX</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CTRLUPD_PRE_SRX</name>
              <description>CTRLUPD_PRE_SRX</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIS_AUTO_CTRLUPD_SRX</name>
              <description>DIS_AUTO_CTRLUPD_SRX</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIS_AUTO_CTRLUPD</name>
              <description>DIS_AUTO_CTRLUPD</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIUPD1</name>
          <displayName>DFIUPD1</displayName>
          <description>DDRCTRL DFI update register 1</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010001</resetValue>
          <fields>
            <field>
              <name>DFI_T_CTRLUPD_INTERVAL_MAX_X1024</name>
              <description>DFI_T_CTRLUPD_INTERVAL_MAX_X1024</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DFI_T_CTRLUPD_INTERVAL_MIN_X1024</name>
              <description>DFI_T_CTRLUPD_INTERVAL_MIN_X1024</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIUPD2</name>
          <displayName>DFIUPD2</displayName>
          <description>DDRCTRL DFI update register 2</description>
          <addressOffset>0x1A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>DFI_PHYUPD_EN</name>
              <description>DFI_PHYUPD_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIMISC</name>
          <displayName>DFIMISC</displayName>
          <description>DDRCTRL DFI miscellaneous control register</description>
          <addressOffset>0x1B0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>DFI_INIT_COMPLETE_EN</name>
              <description>DFI_INIT_COMPLETE_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTL_IDLE_EN</name>
              <description>CTL_IDLE_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFI_INIT_START</name>
              <description>DFI_INIT_START</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFI_FREQUENCY</name>
              <description>DFI_FREQUENCY</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFISTAT</name>
          <displayName>DFISTAT</displayName>
          <description>DDRCTRL DFI status register</description>
          <addressOffset>0x1BC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DFI_INIT_COMPLETE</name>
              <description>DFI_INIT_COMPLETE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFI_LP_ACK</name>
              <description>DFI_LP_ACK</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIPHYMSTR</name>
          <displayName>DFIPHYMSTR</displayName>
          <description>DDRCTRL DFI PHY master register</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>DFI_PHYMSTR_EN</name>
              <description>DFI_PHYMSTR_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRMAP1</name>
          <displayName>ADDRMAP1</displayName>
          <description>DDRCTRL address map register 1</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRMAP_BANK_B0</name>
              <description>ADDRMAP_BANK_B0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_BANK_B1</name>
              <description>ADDRMAP_BANK_B1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_BANK_B2</name>
              <description>ADDRMAP_BANK_B2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
