knieriem/tinygo-stm32-svd/svd/stm32mp153.svd
        <register>
          <name>ADDRMAP2</name>
          <displayName>ADDRMAP2</displayName>
          <description>DDRCTRL address map register 2</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRMAP_COL_B2</name>
              <description>ADDRMAP_COL_B2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_COL_B3</name>
              <description>ADDRMAP_COL_B3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_COL_B4</name>
              <description>ADDRMAP_COL_B4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_COL_B5</name>
              <description>ADDRMAP_COL_B5</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRMAP3</name>
          <displayName>ADDRMAP3</displayName>
          <description>DDRCTRL address map register 3</description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRMAP_COL_B6</name>
              <description>ADDRMAP_COL_B6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_COL_B7</name>
              <description>ADDRMAP_COL_B7</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_COL_B8</name>
              <description>ADDRMAP_COL_B8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_COL_B9</name>
              <description>ADDRMAP_COL_B9</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRMAP4</name>
          <displayName>ADDRMAP4</displayName>
          <description>DDRCTRL address map register 4</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRMAP_COL_B10</name>
              <description>ADDRMAP_COL_B10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_COL_B11</name>
              <description>ADDRMAP_COL_B11</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRMAP5</name>
          <displayName>ADDRMAP5</displayName>
          <description>DDRCTRL address map register 5</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRMAP_ROW_B0</name>
              <description>ADDRMAP_ROW_B0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_ROW_B1</name>
              <description>ADDRMAP_ROW_B1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_ROW_B2_10</name>
              <description>ADDRMAP_ROW_B2_10</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_ROW_B11</name>
              <description>ADDRMAP_ROW_B11</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRMAP6</name>
          <displayName>ADDRMAP6</displayName>
          <description>DDRCTRL address register 6</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRMAP_ROW_B12</name>
              <description>ADDRMAP_ROW_B12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_ROW_B13</name>
              <description>ADDRMAP_ROW_B13</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_ROW_B14</name>
              <description>ADDRMAP_ROW_B14</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_ROW_B15</name>
              <description>ADDRMAP_ROW_B15</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>LPDDR3_6GB_12GB</name>
              <description>LPDDR3_6GB_12GB</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRMAP9</name>
          <displayName>ADDRMAP9</displayName>
          <description>DDRCTRL address map register 9</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRMAP_ROW_B2</name>
              <description>ADDRMAP_ROW_B2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_ROW_B3</name>
              <description>ADDRMAP_ROW_B3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_ROW_B4</name>
              <description>ADDRMAP_ROW_B4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_ROW_B5</name>
              <description>ADDRMAP_ROW_B5</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRMAP10</name>
          <displayName>ADDRMAP10</displayName>
          <description>DDRCTRL address map register 10</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRMAP_ROW_B6</name>
              <description>ADDRMAP_ROW_B6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_ROW_B7</name>
              <description>ADDRMAP_ROW_B7</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_ROW_B8</name>
              <description>ADDRMAP_ROW_B8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRMAP_ROW_B9</name>
              <description>ADDRMAP_ROW_B9</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRMAP11</name>
          <displayName>ADDRMAP11</displayName>
          <description>DDRCTRL address map register 11</description>
          <addressOffset>0x22C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRMAP_ROW_B10</name>
              <description>ADDRMAP_ROW_B10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ODTCFG</name>
          <displayName>ODTCFG</displayName>
          <description>DDRCTRL ODT configuration register</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x04000400</resetValue>
          <fields>
            <field>
              <name>RD_ODT_DELAY</name>
              <description>RD_ODT_DELAY</description>
              <bitOffset>2</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>RD_ODT_HOLD</name>
              <description>RD_ODT_HOLD</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WR_ODT_DELAY</name>
              <description>WR_ODT_DELAY</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>WR_ODT_HOLD</name>
              <description>WR_ODT_HOLD</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ODTMAP</name>
          <displayName>ODTMAP</displayName>
          <description>DDRCTRL ODT/Rank map register</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000011</resetValue>
          <fields>
            <field>
              <name>RANK0_WR_ODT</name>
              <description>RANK0_WR_ODT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RANK0_RD_ODT</name>
              <description>RANK0_RD_ODT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCHED</name>
          <displayName>SCHED</displayName>
          <description>DDRCTRL scheduler control register</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000805</resetValue>
          <fields>
            <field>
              <name>FORCE_LOW_PRI_N</name>
              <description>FORCE_LOW_PRI_N</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PREFER_WRITE</name>
              <description>PREFER_WRITE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGECLOSE</name>
              <description>PAGECLOSE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPR_NUM_ENTRIES</name>
              <description>LPR_NUM_ENTRIES</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>GO2CRITICAL_HYSTERESIS</name>
              <description>GO2CRITICAL_HYSTERESIS</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RDWR_IDLE_GAP</name>
              <description>RDWR_IDLE_GAP</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCHED1</name>
          <displayName>SCHED1</displayName>
          <description>DDRCTRL scheduler control register 1</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PAGECLOSE_TIMER</name>
              <description>PAGECLOSE_TIMER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFHPR1</name>
          <displayName>PERFHPR1</displayName>
          <description>DDRCTRL high priority read CAM register 1</description>
          <addressOffset>0x25C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0F000001</resetValue>
          <fields>
            <field>
              <name>HPR_MAX_STARVE</name>
              <description>HPR_MAX_STARVE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>HPR_XACT_RUN_LENGTH</name>
              <description>HPR_XACT_RUN_LENGTH</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFLPR1</name>
          <displayName>PERFLPR1</displayName>
          <description>DDRCTRL low priority read CAM register 1</description>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0F00007F</resetValue>
          <fields>
            <field>
              <name>LPR_MAX_STARVE</name>
              <description>LPR_MAX_STARVE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>LPR_XACT_RUN_LENGTH</name>
              <description>LPR_XACT_RUN_LENGTH</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFWR1</name>
          <displayName>PERFWR1</displayName>
          <description>DDRCTRL write CAM register 1</description>
          <addressOffset>0x26C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0F00007F</resetValue>
          <fields>
            <field>
              <name>W_MAX_STARVE</name>
              <description>W_MAX_STARVE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>W_XACT_RUN_LENGTH</name>
              <description>W_XACT_RUN_LENGTH</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG0</name>
          <displayName>DBG0</displayName>
          <description>DDRCTRL debug register 0</description>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIS_WC</name>
              <description>DIS_WC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIS_COLLISION_PAGE_OPT</name>
              <description>DIS_COLLISION_PAGE_OPT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG1</name>
          <displayName>DBG1</displayName>
          <description>DDRCTRL debug register 1</description>
          <addressOffset>0x304</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIS_DQ</name>
              <description>DIS_DQ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIS_HIF</name>
              <description>DIS_HIF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCAM</name>
          <displayName>DBGCAM</displayName>
          <description>DDRCTRL CAM debug register</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBG_HPR_Q_DEPTH</name>
              <description>DBG_HPR_Q_DEPTH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DBG_LPR_Q_DEPTH</name>
              <description>DBG_LPR_Q_DEPTH</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DBG_W_Q_DEPTH</name>
              <description>DBG_W_Q_DEPTH</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DBG_STALL</name>
              <description>DBG_STALL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_RD_Q_EMPTY</name>
              <description>DBG_RD_Q_EMPTY</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBG_WR_Q_EMPTY</name>
              <description>DBG_WR_Q_EMPTY</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD_DATA_PIPELINE_EMPTY</name>
              <description>RD_DATA_PIPELINE_EMPTY</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_DATA_PIPELINE_EMPTY</name>
              <description>WR_DATA_PIPELINE_EMPTY</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCMD</name>
          <displayName>DBGCMD</displayName>
          <description>DDRCTRL command debug register</description>
          <addressOffset>0x30C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RANK0_REFRESH</name>
              <description>RANK0_REFRESH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ZQ_CALIB_SHORT</name>
              <description>ZQ_CALIB_SHORT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTRLUPD</name>
              <description>CTRLUPD</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGSTAT</name>
          <displayName>DBGSTAT</displayName>
          <description>DDRCTRL status debug register</description>
          <addressOffset>0x310</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RANK0_REFRESH_BUSY</name>
              <description>RANK0_REFRESH_BUSY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ZQ_CALIB_SHORT_BUSY</name>
              <description>ZQ_CALIB_SHORT_BUSY</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTRLUPD_BUSY</name>
              <description>CTRLUPD_BUSY</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWCTL</name>
          <displayName>SWCTL</displayName>
          <description>DDRCTRL software register programming control enable</description>
          <addressOffset>0x320</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SW_DONE</name>
              <description>SW_DONE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWSTAT</name>
          <displayName>SWSTAT</displayName>
          <description>DDRCTRL software register programming control status</description>
          <addressOffset>0x324</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SW_DONE_ACK</name>
              <description>SW_DONE_ACK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
