knieriem/tinygo-stm32-svd/svd/stm32mp153.svd
        <register>
          <name>IPRIORITYR6</name>
          <displayName>IPRIORITYR6</displayName>
          <description>GICD interrupt priority register 6</description>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR7</name>
          <displayName>IPRIORITYR7</displayName>
          <description>GICD interrupt priority register 7</description>
          <addressOffset>0x41C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR8</name>
          <displayName>IPRIORITYR8</displayName>
          <description>GICD interrupt priority register 8</description>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR9</name>
          <displayName>IPRIORITYR9</displayName>
          <description>GICD interrupt priority register 9</description>
          <addressOffset>0x424</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR10</name>
          <displayName>IPRIORITYR10</displayName>
          <description>GICD interrupt priority register 10</description>
          <addressOffset>0x428</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR11</name>
          <displayName>IPRIORITYR11</displayName>
          <description>GICD interrupt priority register 11</description>
          <addressOffset>0x42C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR12</name>
          <displayName>IPRIORITYR12</displayName>
          <description>GICD interrupt priority register 12</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR13</name>
          <displayName>IPRIORITYR13</displayName>
          <description>GICD interrupt priority register 13</description>
          <addressOffset>0x434</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR14</name>
          <displayName>IPRIORITYR14</displayName>
          <description>GICD interrupt priority register 14</description>
          <addressOffset>0x438</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR15</name>
          <displayName>IPRIORITYR15</displayName>
          <description>GICD interrupt priority register 15</description>
          <addressOffset>0x43C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR16</name>
          <displayName>IPRIORITYR16</displayName>
          <description>GICD interrupt priority register 16</description>
          <addressOffset>0x440</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR17</name>
          <displayName>IPRIORITYR17</displayName>
          <description>GICD interrupt priority register 17</description>
          <addressOffset>0x444</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR18</name>
          <displayName>IPRIORITYR18</displayName>
          <description>GICD interrupt priority register 18</description>
          <addressOffset>0x448</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR19</name>
          <displayName>IPRIORITYR19</displayName>
          <description>GICD interrupt priority register 19</description>
          <addressOffset>0x44C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR20</name>
          <displayName>IPRIORITYR20</displayName>
          <description>GICD interrupt priority register 20</description>
          <addressOffset>0x450</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR21</name>
          <displayName>IPRIORITYR21</displayName>
          <description>GICD interrupt priority register 21</description>
          <addressOffset>0x454</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR22</name>
          <displayName>IPRIORITYR22</displayName>
          <description>GICD interrupt priority register 22</description>
          <addressOffset>0x458</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR23</name>
          <displayName>IPRIORITYR23</displayName>
          <description>GICD interrupt priority register 23</description>
          <addressOffset>0x45C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRIORITYR24</name>
          <displayName>IPRIORITYR24</displayName>
          <description>GICD interrupt priority register 24</description>
          <addressOffset>0x460</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
