knieriem/tinygo-stm32-svd/svd/stm32mp153.svd
        <register>
          <name>ITARGETSR29</name>
          <displayName>ITARGETSR29</displayName>
          <description>GICD interrupt processor target register 29</description>
          <addressOffset>0x874</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR30</name>
          <displayName>ITARGETSR30</displayName>
          <description>GICD interrupt processor target register 30</description>
          <addressOffset>0x878</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR31</name>
          <displayName>ITARGETSR31</displayName>
          <description>GICD interrupt processor target register 31</description>
          <addressOffset>0x87C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR32</name>
          <displayName>ITARGETSR32</displayName>
          <description>GICD interrupt processor target register 32</description>
          <addressOffset>0x880</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR33</name>
          <displayName>ITARGETSR33</displayName>
          <description>GICD interrupt processor target register 33</description>
          <addressOffset>0x884</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR34</name>
          <displayName>ITARGETSR34</displayName>
          <description>GICD interrupt processor target register 34</description>
          <addressOffset>0x888</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR35</name>
          <displayName>ITARGETSR35</displayName>
          <description>GICD interrupt processor target register 35</description>
          <addressOffset>0x88C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR36</name>
          <displayName>ITARGETSR36</displayName>
          <description>GICD interrupt processor target register 36</description>
          <addressOffset>0x890</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR37</name>
          <displayName>ITARGETSR37</displayName>
          <description>GICD interrupt processor target register 37</description>
          <addressOffset>0x894</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR38</name>
          <displayName>ITARGETSR38</displayName>
          <description>GICD interrupt processor target register 38</description>
          <addressOffset>0x898</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR39</name>
          <displayName>ITARGETSR39</displayName>
          <description>GICD interrupt processor target register 39</description>
          <addressOffset>0x89C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR40</name>
          <displayName>ITARGETSR40</displayName>
          <description>GICD interrupt processor target register 40</description>
          <addressOffset>0x8A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR41</name>
          <displayName>ITARGETSR41</displayName>
          <description>GICD interrupt processor target register 41</description>
          <addressOffset>0x8A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR42</name>
          <displayName>ITARGETSR42</displayName>
          <description>GICD interrupt processor target register 42</description>
          <addressOffset>0x8A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR43</name>
          <displayName>ITARGETSR43</displayName>
          <description>GICD interrupt processor target register 43</description>
          <addressOffset>0x8AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR44</name>
          <displayName>ITARGETSR44</displayName>
          <description>GICD interrupt processor target register 44</description>
          <addressOffset>0x8B0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR45</name>
          <displayName>ITARGETSR45</displayName>
          <description>GICD interrupt processor target register 45</description>
          <addressOffset>0x8B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR46</name>
          <displayName>ITARGETSR46</displayName>
          <description>GICD interrupt processor target register 46</description>
          <addressOffset>0x8B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR47</name>
          <displayName>ITARGETSR47</displayName>
          <description>GICD interrupt processor target register 47</description>
          <addressOffset>0x8BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
