knieriem/tinygo-stm32-svd/svd/stm32mp153.svd
        <register>
          <name>ITARGETSR48</name>
          <displayName>ITARGETSR48</displayName>
          <description>GICD interrupt processor target register 48</description>
          <addressOffset>0x8C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR49</name>
          <displayName>ITARGETSR49</displayName>
          <description>GICD interrupt processor target register 49</description>
          <addressOffset>0x8C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR50</name>
          <displayName>ITARGETSR50</displayName>
          <description>GICD interrupt processor target register 50</description>
          <addressOffset>0x8C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR51</name>
          <displayName>ITARGETSR51</displayName>
          <description>GICD interrupt processor target register 51</description>
          <addressOffset>0x8CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR52</name>
          <displayName>ITARGETSR52</displayName>
          <description>GICD interrupt processor target register 52</description>
          <addressOffset>0x8D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR53</name>
          <displayName>ITARGETSR53</displayName>
          <description>GICD interrupt processor target register 53</description>
          <addressOffset>0x8D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR54</name>
          <displayName>ITARGETSR54</displayName>
          <description>GICD interrupt processor target register 54</description>
          <addressOffset>0x8D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR55</name>
          <displayName>ITARGETSR55</displayName>
          <description>GICD interrupt processor target register 55</description>
          <addressOffset>0x8DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR56</name>
          <displayName>ITARGETSR56</displayName>
          <description>GICD interrupt processor target register 56</description>
          <addressOffset>0x8E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR57</name>
          <displayName>ITARGETSR57</displayName>
          <description>GICD interrupt processor target register 57</description>
          <addressOffset>0x8E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR58</name>
          <displayName>ITARGETSR58</displayName>
          <description>GICD interrupt processor target register 58</description>
          <addressOffset>0x8E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR59</name>
          <displayName>ITARGETSR59</displayName>
          <description>GICD interrupt processor target register 59</description>
          <addressOffset>0x8EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR60</name>
          <displayName>ITARGETSR60</displayName>
          <description>GICD interrupt processor target register 60</description>
          <addressOffset>0x8F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR61</name>
          <displayName>ITARGETSR61</displayName>
          <description>GICD interrupt processor target register 61</description>
          <addressOffset>0x8F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR62</name>
          <displayName>ITARGETSR62</displayName>
          <description>GICD interrupt processor target register 62</description>
          <addressOffset>0x8F8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR63</name>
          <displayName>ITARGETSR63</displayName>
          <description>GICD interrupt processor target register 63</description>
          <addressOffset>0x8FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR64</name>
          <displayName>ITARGETSR64</displayName>
          <description>GICD interrupt processor target register 64</description>
          <addressOffset>0x900</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR65</name>
          <displayName>ITARGETSR65</displayName>
          <description>GICD interrupt processor target register 65</description>
          <addressOffset>0x904</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITARGETSR66</name>
          <displayName>ITARGETSR66</displayName>
          <description>GICD interrupt processor target register 66</description>
          <addressOffset>0x908</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
