knieriem/tinygo-stm32-svd/svd/stm32mp153.svd
        <register>
          <name>ICFGR10</name>
          <displayName>ICFGR10</displayName>
          <description>GICD interrupt configuration register 10</description>
          <addressOffset>0xC28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <fields>
            <field>
              <name>INT_CONFIG0</name>
              <description>INT_CONFIG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG1</name>
              <description>INT_CONFIG1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG2</name>
              <description>INT_CONFIG2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG3</name>
              <description>INT_CONFIG3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG4</name>
              <description>INT_CONFIG4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG5</name>
              <description>INT_CONFIG5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG6</name>
              <description>INT_CONFIG6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG7</name>
              <description>INT_CONFIG7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG8</name>
              <description>INT_CONFIG8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG9</name>
              <description>INT_CONFIG9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG10</name>
              <description>INT_CONFIG10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG11</name>
              <description>INT_CONFIG11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG12</name>
              <description>INT_CONFIG12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG13</name>
              <description>INT_CONFIG13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG14</name>
              <description>INT_CONFIG14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG15</name>
              <description>INT_CONFIG15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICFGR11</name>
          <displayName>ICFGR11</displayName>
          <description>GICD interrupt configuration register 11</description>
          <addressOffset>0xC2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <fields>
            <field>
              <name>INT_CONFIG0</name>
              <description>INT_CONFIG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG1</name>
              <description>INT_CONFIG1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG2</name>
              <description>INT_CONFIG2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG3</name>
              <description>INT_CONFIG3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG4</name>
              <description>INT_CONFIG4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG5</name>
              <description>INT_CONFIG5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG6</name>
              <description>INT_CONFIG6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG7</name>
              <description>INT_CONFIG7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG8</name>
              <description>INT_CONFIG8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG9</name>
              <description>INT_CONFIG9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG10</name>
              <description>INT_CONFIG10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG11</name>
              <description>INT_CONFIG11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG12</name>
              <description>INT_CONFIG12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG13</name>
              <description>INT_CONFIG13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG14</name>
              <description>INT_CONFIG14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG15</name>
              <description>INT_CONFIG15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICFGR12</name>
          <displayName>ICFGR12</displayName>
          <description>GICD interrupt configuration register 12</description>
          <addressOffset>0xC30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <fields>
            <field>
              <name>INT_CONFIG0</name>
              <description>INT_CONFIG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG1</name>
              <description>INT_CONFIG1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG2</name>
              <description>INT_CONFIG2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG3</name>
              <description>INT_CONFIG3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG4</name>
              <description>INT_CONFIG4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG5</name>
              <description>INT_CONFIG5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG6</name>
              <description>INT_CONFIG6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG7</name>
              <description>INT_CONFIG7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG8</name>
              <description>INT_CONFIG8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG9</name>
              <description>INT_CONFIG9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG10</name>
              <description>INT_CONFIG10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG11</name>
              <description>INT_CONFIG11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG12</name>
              <description>INT_CONFIG12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG13</name>
              <description>INT_CONFIG13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG14</name>
              <description>INT_CONFIG14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG15</name>
              <description>INT_CONFIG15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICFGR13</name>
          <displayName>ICFGR13</displayName>
          <description>GICD interrupt configuration register 13</description>
          <addressOffset>0xC34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <fields>
            <field>
              <name>INT_CONFIG0</name>
              <description>INT_CONFIG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG1</name>
              <description>INT_CONFIG1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG2</name>
              <description>INT_CONFIG2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG3</name>
              <description>INT_CONFIG3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG4</name>
              <description>INT_CONFIG4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG5</name>
              <description>INT_CONFIG5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG6</name>
              <description>INT_CONFIG6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG7</name>
              <description>INT_CONFIG7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG8</name>
              <description>INT_CONFIG8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG9</name>
              <description>INT_CONFIG9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG10</name>
              <description>INT_CONFIG10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG11</name>
              <description>INT_CONFIG11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG12</name>
              <description>INT_CONFIG12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG13</name>
              <description>INT_CONFIG13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG14</name>
              <description>INT_CONFIG14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG15</name>
              <description>INT_CONFIG15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICFGR14</name>
          <displayName>ICFGR14</displayName>
          <description>GICD interrupt configuration register 14</description>
          <addressOffset>0xC38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <fields>
            <field>
              <name>INT_CONFIG0</name>
              <description>INT_CONFIG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG1</name>
              <description>INT_CONFIG1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG2</name>
              <description>INT_CONFIG2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG3</name>
              <description>INT_CONFIG3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG4</name>
              <description>INT_CONFIG4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG5</name>
              <description>INT_CONFIG5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG6</name>
              <description>INT_CONFIG6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG7</name>
              <description>INT_CONFIG7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG8</name>
              <description>INT_CONFIG8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG9</name>
              <description>INT_CONFIG9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG10</name>
              <description>INT_CONFIG10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG11</name>
              <description>INT_CONFIG11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG12</name>
              <description>INT_CONFIG12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG13</name>
              <description>INT_CONFIG13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG14</name>
              <description>INT_CONFIG14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG15</name>
              <description>INT_CONFIG15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICFGR15</name>
          <displayName>ICFGR15</displayName>
          <description>GICD interrupt configuration register 15</description>
          <addressOffset>0xC3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <fields>
            <field>
              <name>INT_CONFIG0</name>
              <description>INT_CONFIG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG1</name>
              <description>INT_CONFIG1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG2</name>
              <description>INT_CONFIG2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG3</name>
              <description>INT_CONFIG3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG4</name>
              <description>INT_CONFIG4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG5</name>
              <description>INT_CONFIG5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG6</name>
              <description>INT_CONFIG6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG7</name>
              <description>INT_CONFIG7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG8</name>
              <description>INT_CONFIG8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG9</name>
              <description>INT_CONFIG9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG10</name>
              <description>INT_CONFIG10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG11</name>
              <description>INT_CONFIG11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG12</name>
              <description>INT_CONFIG12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG13</name>
              <description>INT_CONFIG13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG14</name>
              <description>INT_CONFIG14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG15</name>
              <description>INT_CONFIG15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
