knieriem/tinygo-stm32-svd/svd/stm32mp153.svd
        <register>
          <name>REGION_BASE_LOW6</name>
          <displayName>REGION_BASE_LOW6</displayName>
          <description>Base address low for regions 1 to 8.</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BASE_ADDRESS_LOW</name>
              <description>BASE_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_BASE_HIGH6</name>
          <displayName>REGION_BASE_HIGH6</displayName>
          <description>Base address high are not used with 32-bit address.</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_TOP_LOW6</name>
          <displayName>REGION_TOP_LOW6</displayName>
          <description>Top address bits [31:12] for region x.</description>
          <addressOffset>0x1C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>TOP_ADDRESS_LOW</name>
              <description>TOP_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_TOP_HIGH6</name>
          <displayName>REGION_TOP_HIGH6</displayName>
          <description>Top address high of region are not used with 32-bit address.</description>
          <addressOffset>0x1CC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_ID_ACCESS6</name>
          <displayName>REGION_ID_ACCESS6</displayName>
          <description>Region non-secure access based on NSAID.</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSAID_RD_EN</name>
              <description>NSAID_RD_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSAID_WR_EN</name>
              <description>NSAID_WR_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_BASE_LOW7</name>
          <displayName>REGION_BASE_LOW7</displayName>
          <description>Base address low for regions 1 to 8.</description>
          <addressOffset>0x2E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BASE_ADDRESS_LOW</name>
              <description>BASE_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_BASE_HIGH7</name>
          <displayName>REGION_BASE_HIGH7</displayName>
          <description>Base address high are not used with 32-bit address.</description>
          <addressOffset>0x2E4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_TOP_LOW7</name>
          <displayName>REGION_TOP_LOW7</displayName>
          <description>Top address bits [31:12] for region x.</description>
          <addressOffset>0x1E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>TOP_ADDRESS_LOW</name>
              <description>TOP_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_TOP_HIGH7</name>
          <displayName>REGION_TOP_HIGH7</displayName>
          <description>Top address high of region are not used with 32-bit address.</description>
          <addressOffset>0x2EC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_ID_ACCESS7</name>
          <displayName>REGION_ID_ACCESS7</displayName>
          <description>Region non-secure access based on NSAID.</description>
          <addressOffset>0x2F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSAID_RD_EN</name>
              <description>NSAID_RD_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSAID_WR_EN</name>
              <description>NSAID_WR_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_BASE_LOW8</name>
          <displayName>REGION_BASE_LOW8</displayName>
          <description>Base address low for regions 1 to 8.</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BASE_ADDRESS_LOW</name>
              <description>BASE_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_BASE_HIGH8</name>
          <displayName>REGION_BASE_HIGH8</displayName>
          <description>Base address high are not used with 32-bit address.</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_TOP_LOW8</name>
          <displayName>REGION_TOP_LOW8</displayName>
          <description>Top address bits [31:12] for region x.</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>TOP_ADDRESS_LOW</name>
              <description>TOP_ADDRESS_LOW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION_TOP_HIGH8</name>
          <displayName>REGION_TOP_HIGH8</displayName>
          <description>Top address high of region are not used with 32-bit address.</description>
          <addressOffset>0x30C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>REGION_ID_ACCESS8</name>
          <displayName>REGION_ID_ACCESS8</displayName>
          <description>Region non-secure access based on NSAID.</description>
          <addressOffset>0x314</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSAID_RD_EN</name>
              <description>NSAID_RD_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSAID_WR_EN</name>
              <description>NSAID_WR_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
